Tekla Open API Reference for Tekla Structures 2025
ModelObjectVisualization.ClearAllTemporaryStates Method
 Clears temporary visualization from all model objects and restores permanent representation.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool ClearAllTemporaryStates()
Public Shared Function ClearAllTemporaryStates As Boolean
Return Value
Type: Boolean
True if the permanent representation could be restored.
See Also
Reference
ModelObjectVisualization Class
Tekla.Structures.Model.UI Namespace